Repository: jgravalo/ft_transcendence
Catalog: back/app/locale/*/LC_MESSAGES/django.po
Languages: es, fr

source: Home
es: Inicio
fr: Accueil

source: Login
es: Iniciar
fr: Connection

source: Register
es: Registrar
fr: Inscription

source: Welcome
es: Bienvenido al cosmic
fr: Bienvenue au cosmique

source: Start
es: Comienza el juego
fr: Commencez le jeu

source: Project
es: © 2025 proyecto ft_transcendence por 42
fr: © 2025 projet ft_transcendence par 42

source: Team
es: Miembros del equipo: Jesús, Manuel, David, Víctor y Luis
fr: Créateurs: Jésus, Manuel, David, Victor et Louis

source: Logout
es: Cerrar sesión
fr: Déconnexion

source: User List
es: Lista de Usuarios
fr: Liste des utilisateurs

source: Search...
es: Buscar...
fr: Rechercher...

source: Search
es: Buscar
fr: Rechercher

source: Friends
es: Amigos
fr: Amis

source: Username
es: Nombre de Usuario
fr: Nom d'utilisateur

source: Email
es: Correo Electrónico
fr: Adresse e-mail

source: Record
es: Registro
fr: Enregistrement

source: You don't have friends
es: No tienes amigos
fr: Vous n'avez pas d'amis

source: Other Users
es: Otros
fr: Autres

source: Blocked Users
es: Usuarios bloqueados

source: There are no users
es: No hay usuarios
fr: Il n'y a pas d'utilisateurs

source: There are no blocked users
es: No hay usuarios bloqueados
fr: Il n'y a pas d'utilisateurs bloqués

source: Play Online
es: 🌐 Jugar en linéa
fr: 🌐 Jouer en Ligne

source: Play Local
es: 🎮 Jugar en local
fr: 🎮 Jouer en Local

source: Submit
es: Ingresar
fr: Envoyer

source: Phone
es: Numero de teléfono
fr: Numéro de téléphone

source: Username or Email Address
es: Nombre de usuario o Correo electrónico
fr: Nom d'utilisateur ou Email

source: Password
es: Contraseña
fr: Mot de passe

source: Please enter a valid password
es: Por favor ingrese una contraseña válida
fr: Veuillez utiliser un mot de passe valide

source: User does not exist
es: El usuario no existe
fr: L'utilisateur n'existe pas

source: Please enter a valid username or email address
es: Por favor ingrese un nombre de usuario o correo electrónico válido
fr: Veuillez utiliser un nom d'utilisateur ou une adresse email correcte

source: Close Session
es: Cerrar sesión
fr: Fermer la session

source: You are going to close your session. Are you sure?
es: Va a cerrar su sesión. ¿Está seguro?
fr: Vous allez clôturer votre session. Etes-vous sûr ?

source: Cancel
es: Cancelar
fr: Annuler

source: Wins
es: Victorias
fr: Victoires

source: Losses
es: Derrotas
fr: Défaites

source: Matches
es: Partidos
fr: Matchs

source: Tournament
es: 🏆 Torneo
fr: 🏆 Tournoi

source: Tournament_description
es: Participa en un Torneo
fr: Participer à un Tournoi

source: Tournament Wins
es: Torneos Ganados
fr: Tournois Gagnés

source: Stats
es: Estadísticas
fr: Statistiques

source: Edit
es: Editar perfil
fr: Modifier le profil

source: User already exists
es: El usuario ya existe
fr: L'utilisateur existe déjà

source: The password must be at least 6 characters long
es: La contraseña debe tener al menos 6 caracteres
fr: Le mot de passe doit contenir au moins 6 caractères

source: Empty field
es: Campo vacío
fr: Champ vide

source: Username cannot start by 'AI'
es: El nombre de usuario no puede comenzar con 'AI'
fr: Le nom d'utilisateur ne peut pas commencer par 'AI'

source: Username cannot include '@'
es: El nombre de usuario no puede incluir '@'
fr: Le nom d'utilisateur ne peut pas inclure '@'

source: The email must include '@'
es: El correo electrónico debe incluir '@'
fr: L'email doit inclure '@'

source: Edit your profile information
es: Edita la información de tu perfil
fr: Modifier les informations de votre profil

source: Current Password
es: Contraseña actual
fr: Mot de passe actuel

source: New Password
es: Nueva contraseña
fr: Nouveau mot de passe

source: Enable Two-Factor Authentication
es: Activar la autenticación en dos pasos (2FA)
fr: Activer l'authentification à deux facteurs (2FA)

source: Introduce your OTP code
es: Introduce tu código OTP
fr: Introduisez votre code OTP

source: Verify
es: Verificar
fr: Vérifier

source: Login with 42
es: Iniciar sesión con 42
fr: Se connecter avec 42

source: Privacy Policy
es: Política de Privacidad
fr: Politique de confidentialité

source: Update
es: Actualizar
fr: Mettre à jour

source: I confirm that I have read and accept the Privacy Policy and authorize the use of my personal data as indicated in it.
es: Confirmo que he leído y acepto la Política de Privacidad y autorizo el uso de mis datos personales según lo indicado en ella.
fr: Je confirme que j'ai lu et accepte la Politique de confidentialité et autorise l'utilisation de mes données personnelles conformément à celle-ci.

source: Last update: 06/03/2025
es: Última actualización: 06/03/2025
fr: Dernière mise à jour: 06/03/2025

source: Legal basis We process your personal data on the basis of your consent, which you give when you register and accept this Privacy Policy. You can withdraw your consent at any time by requesting the deletion of your account.
es: Base legal Procesamos tus datos personales sobre la base de tu consentimiento, que otorgas al registrarte y al aceptar esta Política de Privacidad. Puedes retirar tu consentimiento en cualquier momento solicitando la eliminación de tu cuenta.
fr: Base légale Nous traitons vos données personnelles sur la base de votre consentement, que vous donnez lorsque vous vous inscrivez et acceptez cette Politique de confidentialité. Vous pouvez retirer votre consentement à tout moment en demandant la suppression de votre compte.

source: 2. What data we store
es: 2. Qué datos guardamos
fr: 2. Quelles données nous stockons

source: We collect and store the following information:
es: Recopilamos y almacenamos la siguiente información:
fr: Nous collectons et stockons les informations suivantes :

source: Account data
es: Datos de la cuenta
fr: Données du compte

source: Security Data
es: Datos de seguridad
fr: Données de sécurité

source: Two-factor authentication (2FA) status
es: Estado de autenticación de dos factores (2FA)
fr: Statut de l'authentification à deux facteurs (2FA)

source: JWT session tokens
es: Tokens de sesión JWT
fr: Jetons de session JWT

source: Game Data
es: Datos del juego
fr: Données de jeu

source: Match history
es: Historial de partidas
fr: Historique des matchs

source: Statistics (wins, losses, matches played)
es: Estadísticas (victorias, derrotas, partidas jugadas)
fr: Statistiques (victoires, défaites, matchs joués)

source: Social Data
es: Datos sociales
fr: Données sociales

source: Friends list
es: Lista de amigos
fr: Liste d'amis

source: Blocked users list
es: Lista de usuarios bloqueados
fr: Liste des utilisateurs bloqués

source: 3. Why we store this data
es: 3. Por qué guardamos estos datos
fr: 3. Pourquoi nous stockons ces données

source: Data is stored for:
es: Los datos se almacenan para:
fr: Les données sont stockées pour :

source: Account Management
es: Gestión de cuenta
fr: Gestion du compte

source: Provide and maintain your user account
es: Proporcionar y mantener tu cuenta de usuario
fr: Fournir et maintenir votre compte utilisateur

source: Ensure your account security
es: Garantizar la seguridad de tu cuenta
fr: Assurer la sécurité de votre compte

source: Game Experience
es: Experiencia de juego
fr: Expérience de jeu

source: Manage your game progress and statistics
es: Gestionar tu progreso en el juego y estadísticas
fr: Gérer votre progression et vos statistiques de jeu

source: Improve user experience
es: Mejorar la experiencia de usuario
fr: Améliorer l'expérience utilisateur

source: 4. Legal bases for processing
es: 4. Bases legales del tratamiento
fr: 4. Bases légales du traitement

source: We process your personal data based on the following legal bases:
es: Procesamos tus datos personales en base a las siguientes bases legales:
fr: Nous traitons vos données personnelles sur la base des fondements juridiques suivants :

source: User Consent
es: Consentimiento del usuario
fr: Consentement de l'utilisateur

source: When registering and accepting this privacy policy
es: Al registrarte y aceptar esta política de privacidad
fr: Lors de l'inscription et de l'acceptation de cette politique de confidentialité

source: When providing additional profile information
es: Al proporcionar información adicional en tu perfil
fr: Lors de la fourniture d'informations supplémentaires sur le profil

source: When participating in social features
es: Al participar en funcionalidades sociales
fr: Lors de la participation aux fonctionnalités sociales

source: Contract Execution
es: Ejecución del contrato
fr: Exécution du contrat

source: To provide the game service
es: Para proporcionar el servicio de juego
fr: Pour fournir le service de jeu

source: To manage your account and access
es: Para gestionar tu cuenta y acceso
fr: Pour gérer votre compte et votre accès

source: To maintain your statistics and progress
es: Para mantener tus estadísticas y progreso
fr: Pour maintenir vos statistiques et votre progression

source: Legitimate Interest
es: Interés legítimo
fr: Intérêt légitime

source: To improve our services
es: Para mejorar nuestros servicios
fr: Pour améliorer nos services

source: To ensure platform security
es: Para garantizar la seguridad de la plataforma
fr: Pour assurer la sécurité de la plateforme

source: To prevent fraud and abuse
es: Para prevenir fraudes y abusos
fr: Pour prévenir la fraude et les abus

source: 5. How we protect your data
es: 5. Cómo protegemos tus datos
fr: 5. Comment nous protégeons vos données

source: We implement the following security measures:
es: Implementamos las siguientes medidas de seguridad:
fr: Nous mettons en œuvre les mesures de sécurité suivantes :

source: Access Security
es: Seguridad de acceso
fr: Sécurité d'accès

source: Password encryption using secure algorithms
es: Encriptación de contraseñas usando algoritmos seguros
fr: Chiffrement des mots de passe utilisant des algorithmes sécurisés

source: Optional two-factor authentication (2FA)
es: Autenticación de dos factores (2FA) opcional
fr: Authentification à deux facteurs (2FA) optionnelle

source: JWT tokens for secure sessions
es: Tokens JWT para sesiones seguras
fr: Jetons JWT pour des sessions sécurisées

source: Data Protection
es: Protección de datos
fr: Protection des données

source: Secure storage in PostgreSQL databases
es: Almacenamiento seguro en bases de datos PostgreSQL
fr: Stockage sécurisé dans des bases de données PostgreSQL

source: Encryption of sensitive data in transit (HTTPS)
es: Encriptación de datos sensibles en tránsito (HTTPS)
fr: Chiffrement des données sensibles en transit (HTTPS)

source: 6. Data Transfer
es: 6. Transferencia de datos
fr: 6. Transfert de données

source: Data is hosted on servers within the European Union, the application host is Obambu SARL, located in Paris, France.
es: Los datos se alojan en servidores dentro de la Unión Europea, el host de la aplicación es Obambu SARL, ubicado en París, Francia.
fr: Les données sont hébergées sur des serveurs au sein de l'Union européenne, l'hébergeur de l'application est Obambu SARL, situé à Paris, France.

source: If you use 42 login, the personal data we collect may be transferred to 42, which is the application's authentication provider.
es: Si utilizas el inicio de sesión con 42, los datos personales que recopilamos pueden ser transferidos a 42, que es el proveedor de autenticación de la aplicación.
fr: Si vous utilisez la connexion 42, les données personnelles que nous collectons peuvent être transférées à 42, qui est le fournisseur d'authentification de l'application.

source: 7. Cookies and similar technologies
es: 7. Cookies y tecnologías similares
fr: 7. Cookies et technologies similaires

source: We use cookies and similar technologies for:
es: Utilizamos cookies y tecnologías similares para:
fr: Nous utilisons des cookies et des technologies similaires pour :

source: Essential Functionality
es: Funcionalidad esencial
fr: Fonctionnalités essentielles

source: Session management and authentication
es: Gestión de sesión y autenticación
fr: Gestion de session et authentification

source: User preferences storage
es: Almacenamiento de preferencias de usuario
fr: Stockage des préférences utilisateur

source: Application state maintenance
es: Mantenimiento del estado de la aplicación
fr: Maintenance de l'état de l'application

source: Local Storage
es: Almacenamiento local
fr: Stockage local

source: LocalStorage for game data and preferences
es: LocalStorage para datos de juego y preferencias
fr: LocalStorage pour les données de jeu et les préférences

source: SessionStorage for temporary session information
es: SessionStorage para información temporal de sesión
fr: SessionStorage pour les informations temporaires de session

source: Cookies for authentication tokens
es: Cookies para tokens de autenticación
fr: Cookies pour les jetons d'authentification

source: Security
es: Seguridad
fr: Sécurité

source: Protection against CSRF attacks
es: Protección contra ataques CSRF
fr: Protection contre les attaques CSRF

source: Session validation
es: Validación de sesiones
fr: Validation des sessions

source: Security monitoring
es: Monitoreo de seguridad
fr: Surveillance de la sécurité

source: You can configure your browser to reject some cookies, although this may affect the platform's functionality. For more information about managing cookies in your browser, consult its official documentation.
es: Puedes configurar tu navegador para rechazar algunas cookies, aunque esto puede afectar al funcionamiento de la plataforma. Para más información sobre cómo gestionar las cookies en tu navegador, consulta la documentación oficial del mismo.
fr: Vous pouvez configurer votre navigateur pour rejeter certains cookies, bien que cela puisse affecter le fonctionnement de la plateforme. Pour plus d'informations sur la gestion des cookies dans votre navigateur, consultez sa documentation officielle.

source: 8. Your rights over your data
es: 8. Tus derechos sobre tus datos
fr: 8. Vos droits sur vos données

source: If you believe that the processing of your personal data does not comply with current regulations, you have the right to file a complaint with the Spanish Data Protection Agency (or the competent authority in your country of residence).
es: Si consideras que el tratamiento de tus datos personales no se ajusta a la normativa vigente, tienes derecho a presentar una reclamación ante la Agencia Española de Protección de Datos (o la autoridad competente de tu país de residencia).
fr: Si vous estimez que le traitement de vos données personnelles n'est pas conforme à la réglementation en vigueur, vous avez le droit de déposer une plainte auprès de l'Agence espagnole de protection des données (ou de l'autorité compétente dans votre pays de résidence).

source: As a user, you have the following rights:
es: Como usuario, tienes los siguientes derechos:
fr: En tant qu'utilisateur, vous disposez des droits suivants :

source: Data Control
es: Control de datos
fr: Contrôle des données

source: Access your personal data
es: Acceder a tus datos personales
fr: Accéder à vos données personnelles

source: Modify your profile information
es: Modificar tu información de perfil
fr: Modifier vos informations de profil

source: Request account deletion
es: Solicitar la eliminación de tu cuenta
fr: Demander la suppression de votre compte

source: Export your data
es: Exportar tus datos
fr: Exporter vos données

source: Right to temporary suspension of data processing: You can request that we stop processing your data in certain cases.
es: Derecho a la suspensión temporal del tratamiento de tus datos: Puedes solicitar que dejemos de tratar tus datos en ciertos casos.
fr: Droit à la suspension temporaire du traitement des données : Vous pouvez demander que nous arrêtions de traiter vos données dans certains cas.

source: 9. Data Retention
es: 9. Retención de datos
fr: 9. Conservation des données

source: We retain your personal data while your account is active. If you decide to delete your account, all your personal data will be immediately and permanently deleted. We will only retain anonymized game statistics that do not personally identify you.
es: Conservamos tus datos personales mientras tu cuenta esté activa. Si decides eliminar tu cuenta, todos tus datos personales serán eliminados de forma inmediata y permanente. Únicamente conservaremos estadísticas de juego anonimizadas, que no permiten identificarte personalmente.
fr: Nous conservons vos données personnelles tant que votre compte est actif. Si vous décidez de supprimer votre compte, toutes vos données personnelles seront immédiatement et définitivement supprimées. Nous ne conserverons que des statistiques de jeu anonymisées qui ne permettent pas de vous identifier personnellement.

source: Deletion Process
es: Proceso de eliminación
fr: Processus de suppression

source: All your personal data will be deleted
es: Se eliminarán todos tus datos personales
fr: Toutes vos données personnelles seront supprimées

source: Only anonymous game statistics will be kept
es: Se mantendrán solo las estadísticas de juego anónimas
fr: Seules les statistiques de jeu anonymes seront conservées

source: Your message history and social relationships will be deleted
es: Se eliminará tu historial de mensajes y relaciones sociales
fr: Votre historique de messages et vos relations sociales seront supprimés

source: 10. Minors
es: 10. Menores de edad
fr: 10. Mineurs

source: The service can be used by minors under 18 years of age. If you are under 18, you must obtain consent from your parents or guardians to use the service.
es: El servicio puede ser utilizado por menores de 18 años. Si eres menor de 18 años, debes obtener el consentimiento de tus padres o tutores para utilizar el servicio.
fr: Le service peut être utilisé par les mineurs de moins de 18 ans. Si vous avez moins de 18 ans, vous devez obtenir le consentement de vos parents ou tuteurs pour utiliser le service.

source: If you become aware that a user under 18 is using the service, you must notify the service administration.
es: Si tienes conocimiento de que un usuario menor de 18 años está utilizando el servicio, debes notificarlo a la administración del servicio.
fr: Si vous avez connaissance qu'un utilisateur de moins de 18 ans utilise le service, vous devez en informer l'administration du service.

source: 11. Changes to the Privacy Policy
es: 11. Cambios a la Política de Privacidad
fr: 11. Modifications de la politique de confidentialité

source: We may update this Privacy Policy at any time. We will notify you of significant changes through the application or the email associated with your account. The date of the last update will be indicated at the top of this page.
es: Podemos actualizar esta Política de Privacidad en cualquier momento. Te notificaremos de los cambios importantes a través de la aplicación o el correo electrónico asociado a tu cuenta. La fecha de la última actualización se indicará en la parte superior de esta página.
fr: Nous pouvons mettre à jour cette politique de confidentialité à tout moment. Nous vous informerons des changements importants via l'application ou l'email associé à votre compte. La date de la dernière mise à jour sera indiquée en haut de cette page.

source: 12. Contact
es: 12. Contacto

source: For any privacy and data handling inquiries, you can contact the system administrator at contact@pong42.com
es: Para cualquier consulta relacionada con la privacidad y el manejo de tus datos, puedes contactar al administrador del sistema al correo contacto@pong42.com
fr: Pour toute question concernant la confidentialité et le traitement des données, vous pouvez contacter l'administrateur système à l'adresse contact@pong42.com

source: 1. Data Controller
es: 1. Responsable del tratamiento de datos
fr: 1. Responsable du traitement des données

source: The data controller is Pong42, with address Carrer d'Albert Einstein, 11, Nou Barris, 08042 Barcelona.
es: El responsable del tratamiento de datos es Pong42, con dirección Carrer d'Albert Einstein, 11, Nou Barris, 08042 Barcelona.
fr: Le responsable du traitement des données est Pong42, avec l'adresse Carrer d'Albert Einstein, 11, Nou Barris, 08042 Barcelona.

source: Local_description
es: Jugar en el mismo teclado
fr: Jouer sur le même clavier

source: Online
es: 🧑‍🤝‍🧑 En línea
fr: 🧑‍🤝‍🧑 En ligne

source: Online_description
es: Jugar contra otro jugador
fr: Jouer contre un autre joueur

source: Match History
es: Historial de Partidos
fr: Historique des matchs

source: Blocked
es: Bloqueados
fr: Bloqués

source: No matches played yet
es: No hay partidos jugados aún
fr: Aucun match joué pour l'instant

source: Actions
es: Acciones

source: Date
es: Fecha

source: 💬 Chat
es: 💬 Chatear

source: 💔 Unfriend
es: 💔 Eliminar Amigo
fr: 💔 Retirer de mes amis

source: 🔓 Unblock
es: 🔓 Desbloquear
fr: 🔓 Débloquer

source: ❤️ Add Friend
es: ❤️ Agregar Amigo
fr: ❤️ Ajouter en ami

source: 🚫 Block
es: 🚫 Bloquear
fr: 🚫 Bloquer

source: Oops! Page not found
es: ¡Uy! Página no encontrada

source: Download account data
es: Descargar datos de la cuenta
fr: Télécharger les données du compte

source: Delete account
es: Eliminar cuenta
fr: Supprimer le compte

source: Anonymize account
es: Anonimizar cuenta
fr: Anonymiser le compte

source: Back to home
es: Volver al inicio
fr: Retour à la maison

source: ⚔️ Game
es: ⚔️ Jugar
fr: ⚔️ Jeu

source: 🛠️ Update Avatar Picture
es: 🛠️ Cambiar la foto
fr: 🛠️ Changer la photo

source: Player 1
es: Jugador 1
fr: Joueur 1

source: Player 2
es: Jugador 2
fr: Joueur 2

source: Pause
es: Pausa

source: Resume
es: Reanudar
fr: Reprendre

source: Start Game
es: Nueva Partida
fr: Nouvelle Partie

source: New Game
es: Nueva Partida
fr: Nouvelle Partie

source: Back
es: 🔙 Volver
fr: 🔙 Retour

source: Play as Guest
es: 👤 Invitado
fr: 👤 Invité

source: Jump into a quick match — no login needed
es: Entra en una partida rápida
fr: Lancez une partie rapide

source: Log In to Play
es: 🔐 Iniciar
fr: 🔐 Se connecter

source: Save your stats, progress, and compete with others
es: Guarda estadísticas & progreso
fr: Sauvegardez vos stats & progrès

source: Start Game to begin...
es: Inicia el juego...
fr: Démar le jeu pour commencer...

source: Looking for opponent...
es: Buscando oponente...
fr: Recherche d'un adversaire...

source: Match in progress...
es: Partida en progreso...
fr: Partie en cours...

source: Game over! You won!
es: ¡Ganaste! 😀
fr: Vous avez gagné 😀

source: Game over! You lost!
es: ¡Perdiste! 😵
fr: Vous avez perdu 😵

source: There are no tournaments
es: No hay torneos
fr: Il n'y a pas de tournois

source: table.tournament.name
es: Nombre del torneo
fr: Nom du tournoi

source: table.tournament.size
es: Sala
fr: Salle

source: table.tournament.status
es: Estado
fr: Statut

source: profile.tournaments.join
es: ⚔️ Unirse
fr: ⚔️ Rejoindre

source: profile.tournaments.leave
es: 🔙 Salir
fr: 🔙 Quitter

source: profile.tournaments.joined
es: Sala unida. Esperando que la sala se llena...
fr: En attente que la salle soit pleine...

source: profile.tournaments.notjoined
es: Unirse para entrar al torneo
fr: Entrez pour participer à un tournoi

source: Start online
fr: Jouer en ligne
